{
  "architectures": [
    "BertModel"
  ],
  "attention_probs_dropout_prob": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "type_vocab_size": 2,
  "vocab_size": 30522,
  "encoder_width": 768,
  "add_cross_attention": true,  
  "hidden_dim": 768,
  "dropout": 0.0,
  "nheads": 8,
  "num_queries": 900,
  "dim_feedforward": 2048,
  "dec_layers": 6,
  "pre_norm": false,
  "query_dim": 4,
  "transformer_activation": "relu",
  "num_patterns": 0,
  "num_feature_levels": 4,
  "dec_n_points": 4,
  "embed_init_tgt": true,
  "use_text_cross_attention": true
}
